# Label Utils Get Label For Symbol Method

Source: https://www.revitapidocs.com/2026/d8dc0d86-c548-89ba-da65-3f3a9b2f9ec8.htm

---

| Label Utils Get Label For Symbol Method |
| --- |

Gets the user\-visible name for a symbol.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetLabelForSymbol(
	ForgeTypeId symbolTypeId
)
```

```
Public Shared Function GetLabelForSymbol (
	symbolTypeId As ForgeTypeId
) As String
```

```
public:
static String^ GetLabelForSymbol(
	ForgeTypeId^ symbolTypeId
)
```

```
static member GetLabelForSymbol :
        symbolTypeId : ForgeTypeId -> string
```

#### Parameters

symbolTypeId ForgeTypeId
:   Identifier of the symbol to get the user\-visible name.

#### Return Value

String
Returns the user\-visible name for a symbol. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Symbol must have a definition. |
| ArgumentNullException | A non\-optional argument was null |

Remarks The name is obtained in the current Revit language. See Also

#### Reference

LabelUtils Class Autodesk.Revit.DB Namespace